In [1]:
import json
import pandas as pd

In [2]:
with open('job7_v2.json', 'r', encoding='utf-8') as infile:
    jobs7 = json.load(infile)

In [7]:
cate = []
salary = []

for i in range(len(jobs7)):
    if jobs7[i]["分類"] != None and jobs7[i]["工作待遇"] != '待遇面議（經常性薪資達 4 萬元或以上）':
        cate.append(int(jobs7[i]["分類"]))
        salary.append(jobs7[i]["工作待遇"])

In [8]:
cate_salary = pd.DataFrame({
    'cate': cate,
    'salary': salary
})

In [9]:
cate_salary

       cate  salary
0         1  130769
1         4   65000
2         1   77500
3         0   60000
4         3   45000
...     ...     ...
17145     2   45000
17146     3   41000
17147     3   45000
17148     3   62500
17149     2   45000

[17150 rows x 2 columns]

In [13]:
cate_salary.to_csv('cate_salary.csv', encoding='utf-8')